**Загружаем и обрабатываем данные**

In [6]:
import pandas as pd

Загрузите этот файл в датафрейм Pandas (с именем df). Однако, будьте осторожны - перед отправкой кода на проверку посмотрите на свой результат и убедитесь, что:
Каждая переменная считалась в отдельный столбец
Все столбцы названы верно
Нет лишних строк

In [7]:
df = pd.read_csv('../data/itresume-users-pandas.csv', sep=';', encoding='1251', skiprows=1)

df

      id       username          date_joined
0    416  nsosabisfsobm  2022-01-02 12:22:43
1     43    NbabnnbTona  2021-07-01 09:11:42
2     50           jbdn  2021-08-04 09:01:56
3    249       Kbaoxsnb  2021-11-27 07:03:35
4     77   bxakbasmo$$$  2021-11-09 14:31:46
..   ...            ...                  ...
95   946     Mbbn$xb$eo  2022-01-29 18:04:23
96   947            NaN  2022-01-29 18:31:26
97  1050     nsosabndsi  2022-02-01 21:02:59
98  1076    SbsdSaobdox  2022-02-02 19:31:21
99  1090           Addb  2022-02-03 13:14:15

[100 rows x 3 columns]

In [8]:
df.index.tolist()

[0,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 34,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50,
 51,
 52,
 53,
 54,
 55,
 56,
 57,
 58,
 59,
 60,
 61,
 62,
 63,
 64,
 65,
 66,
 67,
 68,
 69,
 70,
 71,
 72,
 73,
 74,
 75,
 76,
 77,
 78,
 79,
 80,
 81,
 82,
 83,
 84,
 85,
 86,
 87,
 88,
 89,
 90,
 91,
 92,
 93,
 94,
 95,
 96,
 97,
 98,
 99]

In [9]:
df.columns.tolist()

['id', 'username', 'date_joined']

In [10]:
df1 = df.tail(3)
df1

      id     username          date_joined
97  1050   nsosabndsi  2022-02-01 21:02:59
98  1076  SbsdSaobdox  2022-02-02 19:31:21
99  1090         Addb  2022-02-03 13:14:15

Загрузите этот файл в датафрейм Pandas (с именем df). Однако, будьте осторожны - перед отправкой кода на проверку посмотрите на свой результат и убедитесь, что вы все загрузили корректно.
А затем сформируйте словарь params, который будет содержать информацию о датафрейме:
список имен столбцов
размер датафрейма
форма датафрейма

In [11]:
df2 = df.copy()

In [12]:
df2.shape

(100, 3)

In [13]:
df2.size

300

In [14]:
params = {
	'Имена столбцов' : df2.columns.tolist(),
	'Размер' : df2.size,
	'Форма' : df2.shape
}

params

{'Имена столбцов': ['id', 'username', 'date_joined'],
 'Размер': 300,
 'Форма': (100, 3)}

Создайте переменную are_types_equal, в которую запишите результат сравнения типа данных у столбцов username и date_joined.

In [15]:
df3 = df2.copy()

In [16]:
df3.dtypes

id              int64
username       object
date_joined    object
dtype: object

In [17]:
if df3['username'].dtype == df3['date_joined'].dtype:
	are_types_equal = True
else:
	are_types_equal = False

are_types_equal

True

Создайте (или переопределите) переменную df таким образом, чтобы она содержала столбцы с названиями:
user_id (ранее - id)
created_at (ранее - date_joined)
login (ранее - username)
Столбцы должны идти в заданном порядке и иметь именно такие названия.

In [18]:
df4 = df.copy()

df4 = df4.rename(columns={'id' : 'user_id', 'date_joined' : 'created_at','username' : 'login'})

In [19]:
df4 = df4[['user_id', 'created_at', 'login']]
df4

    user_id           created_at          login
0       416  2022-01-02 12:22:43  nsosabisfsobm
1        43  2021-07-01 09:11:42    NbabnnbTona
2        50  2021-08-04 09:01:56           jbdn
3       249  2021-11-27 07:03:35       Kbaoxsnb
4        77  2021-11-09 14:31:46   bxakbasmo$$$
..      ...                  ...            ...
95      946  2022-01-29 18:04:23     Mbbn$xb$eo
96      947  2022-01-29 18:31:26            NaN
97     1050  2022-02-01 21:02:59     nsosabndsi
98     1076  2022-02-02 19:31:21    SbsdSaobdox
99     1090  2022-02-03 13:14:15           Addb

[100 rows x 3 columns]

При выгрузке данных с нашего сервера произошли небольшие сбои, которые мы не успели пофиксить:
У некоторых имен пользователей в разные места логина добавились значки долларов.
Некоторые имена пользователей не прогрузились вообще.

In [20]:
df5 = df.copy()

In [21]:
df5 = df5.dropna()

In [22]:
df5 = df5.replace('\$', '', regex = True)
df5

      id       username          date_joined
0    416  nsosabisfsobm  2022-01-02 12:22:43
1     43    NbabnnbTona  2021-07-01 09:11:42
2     50           jbdn  2021-08-04 09:01:56
3    249       Kbaoxsnb  2021-11-27 07:03:35
4     77      bxakbasmo  2021-11-09 14:31:46
..   ...            ...                  ...
94   861    KbaxsnDsnom  2022-01-27 17:02:21
95   946       Mbbnxbeo  2022-01-29 18:04:23
97  1050     nsosabndsi  2022-02-01 21:02:59
98  1076    SbsdSaobdox  2022-02-02 19:31:21
99  1090           Addb  2022-02-03 13:14:15

[98 rows x 3 columns]

Сформируйте список dates, который будет содержать уникальные даты регистрации пользователей в формате YYYY-MM-DD.

In [23]:
df6 = df.copy()

In [24]:
dates = []
dates = df6['date_joined']
dates = pd.to_datetime(dates).dt.strftime('%Y-%m-%d').unique().tolist()

dates

['2022-01-02',
 '2021-07-01',
 '2021-08-04',
 '2021-11-27',
 '2021-11-09',
 '2021-11-10',
 '2022-04-06',
 '2021-11-19',
 '2022-04-18',
 '2021-11-24',
 '2021-11-25',
 '2021-11-26',
 '2021-11-28',
 '2021-11-29',
 '2021-11-30',
 '2021-12-01',
 '2021-12-02',
 '2021-12-03',
 '2021-12-04',
 '2021-12-05',
 '2021-12-06',
 '2021-12-08',
 '2021-12-11',
 '2021-12-17',
 '2021-12-18',
 '2021-12-20',
 '2021-12-22',
 '2021-12-24',
 '2021-12-26',
 '2021-12-28',
 '2021-12-29',
 '2021-12-30',
 '2022-01-01',
 '2022-01-04',
 '2022-01-05',
 '2022-01-08',
 '2022-01-09',
 '2022-01-13',
 '2022-01-16',
 '2022-01-17',
 '2022-01-18',
 '2022-01-21',
 '2022-01-22',
 '2022-01-24',
 '2022-01-25',
 '2022-01-26',
 '2022-01-27',
 '2022-01-29',
 '2022-02-01',
 '2022-02-02',
 '2022-02-03']

Загрузите этот файл в датафрейм Pandas (с именем df). Однако, будьте осторожны - перед отправкой кода на проверку посмотрите на свой результат и убедитесь, что вы все загрузили корректно.
Создайте словарь registrations_by_weekday, который будет содержать информацию о дне недели и количестве зарегистрированных в этот день пользователей:

In [25]:
df7 = df.copy()
df7['weekday'] = pd.to_datetime(df7['date_joined']).dt.day_name()
df7 = df7.groupby('weekday').count().reset_index()
df7

     weekday  id  username  date_joined
0     Friday   9         9            9
1     Monday  18        17           18
2   Saturday  16        15           16
3     Sunday  11        11           11
4   Thursday  15        15           15
5    Tuesday  12        12           12
6  Wednesday  19        19           19

In [26]:
df7 = df7.sort_values('id', ascending=False)
df7

     weekday  id  username  date_joined
6  Wednesday  19        19           19
1     Monday  18        17           18
2   Saturday  16        15           16
4   Thursday  15        15           15
5    Tuesday  12        12           12
3     Sunday  11        11           11
0     Friday   9         9            9

In [27]:
registrations_by_weekday = dict(zip(df7['weekday'], df7['id']))
registrations_by_weekday

{'Wednesday': 19,
 'Monday': 18,
 'Saturday': 16,
 'Thursday': 15,
 'Tuesday': 12,
 'Sunday': 11,
 'Friday': 9}